Repository: alexmasu/Macro-Challenge-Hurricane
Catalog: Macro-Challenge-Hurricane/*.lproj/Localizable.strings
Languages: it

# QuizTheory
source: Theory
it: Teoria

# QuizNextQuestion
source: Next
it: Successiva

# QuizTimeDescription
source: Select the correct answer to each of the following questions.
it: Seleziona la risposta corretta a ciascuna delle seguenti domande.

# QuizTimeLetsGo
source: Let's Go!
it: Iniziamo!

# QuizScoreDescriptionA
source: You're a HIG Master!
it: Sei un maestro delle HIG !

# QuizScoreDescriptionB
source: Excellent job!
it: Lavoro eccellente!

# QuizScoreDescriptionC
source: Nice Job!
it: Bel lavoro!

# QuizScoreDescriptionD
source: Keep working hard!
it: Continua a lavorare sodo!

# QuizScoreDescriptionF
source: Better luck next time!
it: Andrà meglio la prossima volta!

# QuizScore
source: Final Score:
it: Punteggio finale:

# QuizGrade
source: Letter Grade:
it: Voto finale:

# QuizTimeElapsed
source: Total time:
it: Tempo totale:

# QuizSeconds
source: seconds
it: secondi

# QuizRestart
source: Re-take Quiz
it: Ripeti quiz

source: Question
it: Domanda

# Question1
source: When and how is it best to use page controls?
it: Quando e come è preferibile usare i controlli di pagina ?

# Question2
source: When is it better to use the progress bars?
it: Quando è preferibile usare le barre di avanzamento ?

# Question3
source: How to configure the system buttons?
it: Come configurare i bottoni di sistema ?

# Question4
source: How to use an action sheet?
it: Come utilizzare un action sheet ?

# Question5
source: How to make a text always readable?
it: Come rendere un testo sempre leggibile ?

# Question6
source: What is meant by aesthetic integrity?
it: Cosa si intende per integrità estetica ?

# Question7
source: How many tabs are generally best placed in a Tab Bar?
it: Quante schede è meglio , generalmente, inserire in una Tab Bar?

# Question8
source: How do you strengthen the meaning of a command in a context menu?
it: In un menu contestuale come si rafforza il significato di un comando?

# Question9
source: Why are metaphors so important in UI / UX?
it: Perché le metafore, in UI/UX sono molto importanti?

# Question10
source: Why limit the number of segmented checks?
it: Perché limitare il numero di controlli segmentati?

# Answer1_1
source: When the scrolling is too long, giving the user the possibility to choose
it: Quando lo scrolling è troppo lungo ,dando la possibilità all’utente di poter scegliere

# Answer1_2
source: When the scrolling is long, as the only possibility
it: Quando lo scrolling è lungo ,come unica possibilità

# Answer1_3
source: You can always use it and it is always the best choice
it: Si può sempre usare ed è sempre la scelta migliore

# Answer2_1
source: For quantifiable activities, if there is a defined duration
it: Per attività quantificabili, se si ha una durata definita

# Answer2_2
source: To make the app seem busier
it: Per far sembrare l’app più occupata

# Answer2_3
source: Never, it is better to use an activity indicator
it: Mai, è meglio usare un indicatore di attività

# Answer3_1
source: The system buttons have a default style that cannot be changed
it: I bottoni di sistema hanno uno stile di default non modificabile

# Answer3_2
source: It is mandatory to insert images or subtitles
it: È obbligatorio inserire immagini o sottotitoli

# Answer3_3
source: You can add symbols, subtitles and fill in buttons to improve UX
it: È possibile aggiungere simboli, sottotitoli e riempire i bottoni per migliorare la UX

# Answer4_1
source: To make choices related to the action, by providing a cancel button at the top left
it: Per dare scelte relative all’azione ,fornendo un tasto annulla in alto a sinistra

# Answer4_2
source: Give many alternatives to make it more precise and effective
it: Dare molte alternative per renderlo più preciso ed efficace

# Answer4_3
source: To provide elements not related to the action performed
it: Per fornire elementi non legati all’azione eseguita

# Answer5_1
source: Use large writing so that it is always legible
it: Usare una scrittura grande in modo che sia sempre ben leggibile

# Answer5_2
source: Use a dynamic type and test with accessibility conditions enabled
it: Usare un tipo dinamico e testare con le condizione di accessibilità abilitate

# Answer5_3
source: Use bold
it: Usare il grassetto

# Answer6_1
source: Delete the hierarchy
it: Eliminare la gerarchia

# Answer6_2
source: Indicates the need to always use the same color and font
it: Indica la necessità di dover usare sempre lo stesso colore e lo stesso font

# Answer6_3
source: Indicates the way in which the function of the app and its structure are connected
it: Indica il modo in cui la funzione dell’app e la sua struttura sono collegate

# Answer7_1
source: Few tabs to have broad categories
it: Poche schede in modo da avere categorie ampie

# Answer7_2
source: Many tabs to be specific
it: Molte schede in modo da essere specifici

# Answer7_3
source: A number that allows the specification and does not affect the interface
it: Un numero che consenta specifica e non appesantisca l’interfaccia

# Answer8_1
source: Using a different color
it: Usando un colore diverso

# Answer8_2
source: Using a glyph
it: Usando un glifo

# Answer8_3
source: Using bold or a different font
it: Usando il grassetto o un font diverso

# Answer9_1
source: They facilitate interaction
it: Facilitano l’interazione

# Answer9_2
source: Enhance the interface
it: Migliorano l’interfaccia

# Answer9_3
source: Make the text easier to understand
it: Facilitano la comprensione del testo

# Answer10_1
source: Increase cognitive load
it: Aumentano il carico cognitivo

# Answer10_2
source: To improve usability
it: Per migliorare l’usabilità

# Answer10_3
source: You should never use them
it: Non bisogna mai usarli
